using Telegram.Bot.Types;
using Telegram.Bot;

namespace BotHost.Controllers.Commands
{
    public class HistoryCommand : ICommand
    {
        public TelegramBotClient Client => Bot.GetTelegramBot().Result;

        public string Name => "Історія НУ ЛП"; // Назва кнопки, що відповідає тексту

        public async Task Execute(Update update)
        {
            long chatId = update.Message.Chat.Id;

            string historyText = "Національний університет «Львівська політехніка» – визнаний осередок науки та освіти, відомий в Україні та далеко за її межами. Історичний шлях університету тісно перегукується із загальною історією України, історією розвитку вітчизняної освіти та науки. Змінюються епохи і політичний статус Західної України, найменування освітнього закладу, але ніколи не зупиняється у своєму поступі Львівська політехніка. Упродовж своєї історії вона залишається відданою своєму призначенню – підготовці висококваліфікованих фахівців.\n\n"
                              + "Львівська політехніка – це університет з понад двохсотлітніми традиціями, який здобув міжнародне визнання та має загальновизнаний імідж. Освітні й наукові досягнення, отримані у різних галузях науки, ґрунтуються на синергії інженерних, природничих, економічних та соціогуманітарних шкіл. Фундаментальними принципами, що окреслюють ідеологію сучасної Львівської політехніки, є високий професіоналізм, академічна свобода та інституційна автономія, інноваційність у дослідженні та викладанні, довіра, повага та справедливість.\n\n"
                              + "Пошук своїх справжніх витоків для Львівської політехніки є природною історичною потребою. Історична модель будь-якого закладу вищої освіти (далі – ЗВО) є цілісною тоді, коли ріст історичного дерева розпочинається з міцного коріння. У час незалежної України настав слушний момент для Національного університету «Львівська політехніка», щоб доповнити, а радше, розширити свою історію на засадах принципу історизму та еволюційної системи літочислення ЗВО, упровадженої в Україні 2005 року на основі Болонського освітнього процесу. До речі, у багатьох країнах Європи і світу вже давно технічні університети привели свої хронології до еволюційної системи літочислення закладів вищої освіти.\n\n"
                              + "Тривалий час уважалось, що витоки Національного університету «Львівська політехніка» сягають 1844 року, коли австрійський уряд шляхом реорганізації утворив Технічну академію у Львові. Із цього історичного факту випливає, що академія постала не як новостворений освітній заклад, а як навчальна установа створена на базі вже діючої Реально-торговельної академії. Оскільки 1844 року виник не новий освітній заклад, а в черговий раз реорганізований, тому цілісну історію Національного університету «Львівська політехніка» треба розпочинати від джерел тобто від витоків, а саме: від часу створення Реальної школи у Львові а 1816 році (документально підтверджується королівським декретом австрійського імператора Франца І за № 78, який було видано в Мілані 7 березня 1816 року).";

            await Client.SendTextMessageAsync(
                chatId: chatId,
                text: historyText
            );
        }
    }
}
